In [1]:
#Pandas a SQL
#Pandas es muy bueno con SQL
import pandas as pd

datos = {'a':[1,2,3],'b':[5,6,7]}
df = pd.DataFrame(datos)

In [2]:
df

   a  b
0  1  5
1  2  6
2  3  7

In [3]:
import sqlite3

In [7]:
#df to_sql https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_sql.html
db = sqlite3.connect('datos.sqlite')
df.to_sql("tweets2",db,if_exists='replace')

In [8]:
#recuperar dataframe de sqlite
db = sqlite3.connect('datos.sqlite')
df = pd.read_sql_table("tweets",'sqlite:///datos.sqlite')

In [9]:
df

   index  a  b
0      0  1  5
1      1  2  6
2      2  3  7

In [10]:
#ver si crea las tablas y las sentencias SQL que genera y como hacer append de datos

In [11]:
import sqlite3
import pandas as pd
db2 = sqlite3.connect('../tweets.sqlite')
df = pd.read_sql_table('arduino','sqlite:///..//tweets.sqlite')

In [12]:
df

       index                                                  0
0          0  {'created_at': 'Wed Jun 03 21:27:56 +0000 2020...
1          1  {'created_at': 'Wed Jun 03 21:26:08 +0000 2020...
2          2  {'created_at': 'Wed Jun 03 21:24:20 +0000 2020...
3          3  {'created_at': 'Wed Jun 03 21:23:06 +0000 2020...
4          4  {'created_at': 'Wed Jun 03 21:22:54 +0000 2020...
...      ...                                                ...
16264     64  {'created_at': 'Wed May 27 06:38:18 +0000 2020...
16265     65  {'created_at': 'Wed May 27 06:38:11 +0000 2020...
16266     66  {'created_at': 'Wed May 27 06:37:56 +0000 2020...
16267     67  {'created_at': 'Wed May 27 06:36:34 +0000 2020...
16268     68  {'created_at': 'Wed May 27 06:28:49 +0000 2020...

[16269 rows x 2 columns]